Revit 2024 API
CanExecuteEventArgs.GetSelectedCategoryIds Method
Gets the category ids of selected elements.
Namespace: Autodesk.Revit.UI.Events
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public ICollection<ElementId> GetSelectedCategoryIds()
Visual Basic
Public Function GetSelectedCategoryIds As ICollection(Of ElementId)
Visual C++
public:
ICollection<ElementId^>^ GetSelectedCategoryIds()
See Also
CanExecuteEventArgs Class
Autodesk.Revit.UI.Events Namespace